cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "heroku/brew"

cask "font-inconsolata"
cask "dropbox"
cask "gas-mask"
cask "iterm2"
cask "visual-studio-code"
cask "firefox"
cask "google-chrome"
cask "spotify"
cask "appcleaner"
cask "docker"
cask "java"
cask "xquartz"
cask "nordvpn"
cask "coconutbattery"
cask "little-snitch"
cask "micro-snitch"
cask "slack"
cask "dashlane"

brew "rbenv"
brew "tmate"
brew "heroku"
brew "gpg" # Install gpg : required for rvm install
brew "mackup"
brew "bash"
brew "zsh"
brew "wget"
brew "bat"

brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "pkg-config"

# Install more recent versions of some macOS tools.
brew "vim"
brew "grep"
brew "openssh"
brew "screen"

#########
# From https://github.com/mathiasbynens/dotfiles
#########
# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hashpump"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp"
brew "xpdf"
brew "xz"

# Install other useful binaries.
brew "ack"
brew "git"
brew "git-lfs"
brew "imagemagick"
brew "lua"
brew "lynx"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
